Глобальная база данных административных областей: http://gadm.org/
Росстат: http://www.gks.ru/

Russia <- readRDS("RUS_adm1.rds")  #Грузим карту
Russia@data #Cмотрим, как выглядят данные.
Russia@data$NL_NAME_1 #Смотрим области, с сайта росстата берем данные
Russia@data$Earnings = c(22415, 21007, 29703, 30922, 24014, 27814, 27907, 25082, 25344, 22457, 24464, 57333, 18507, 39844, 26808, 18179, 13336, 22203, 22494, 18766, 25042, 14233, 26695, 39494, 17913, 25712, 21552, 37677, 20648, 44519, 22421, 33312, 22385, 31375, 26853, 20140, 25780, 26231, 27629, 48784, 17692, 17455,15000, 38395, 35952, 71072, 30849, 21889, 25641, 23793, 25770, 22818, 23205, 21103, 32692, 34080, 21178, 26480, 24074, 48852, 37857, 26916, 20129, 24067, 22675, 34696, 34696, 34696, 25078, 31391, 23786, 26425, 15094, 23579, 29130, 24931, 27883, 22867, 19283, 21465, 25387, 18568, 27937, 24826, 18756)
#Добавляем таблицу данных с указанием среднего уровня дохода по областям в объект Russia

oblast <- as.character(Russia$NAME_1) #Берем аббревиатуры областей
oblast <-gsub("RU.", "", oblast) #очищаем
NameOnMap <- list('sp.text', coordinates(Russia), oblast, cex=.6)


spplot(Russia, "Earnings", scales = list(draw = T), col.regions = rainbow(n = 85), sp.layout = NameOnMap, xlim=c(0,200), main = "Средний доход на территории РФ" ) #Отрисовываем координатную ось, центрируем карту, раскрашиваем 85 регионов по уровню дохода

###
ПОИГРАЕМ С ЦВЕТАМИ
my.palette <- brewer.pal(n = 7, name = "Pastel1")
spplot(Russia, "Earnings", scales = list(draw = T), col.regions = my.palette, , sp.layout = NameOnMap, main = "Средний доход на территории РФ" )
